InformationRegisters/pcru_ex_СопоставлениеВнешнихДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>pcru_ex_СопоставлениеВнешнихДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаДляНУ</v8:Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.БНФОСчетаАналитическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.pcru_ex_ТипыВнешнихДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВнешнихДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаКонтрагенту</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БНФОПеречислениеНаДепозиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалогаЗаТретьихЛиц</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаРаботнику</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДивидендов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДепонентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеСотрудникуПоДоговоруПодряда</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗаработнойПлатыРаботнику</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pcru_ex_СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налогоплательщик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БНФОДоговорКредитаДепозита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОДоговорыКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налог</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеДивидендов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БНФОВидПлатежаПоКредитамЗаймам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейПоКредитамЗаймам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалоговогоОбязательства</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяВедомость</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БНФОКонверсионныйДоговор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.БНФОКонверсионныйДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЭ_Идентификатор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>пкру_РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>пкру_CostCentr</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>пкру_СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/pcru_ex_СозданиеДокументов/Ext/Module.bsl
Функция СоздатьПлатежноеПОручение(Param) Экспорт
	СтруктураПараметров                   = pcru_ex_WSWORKS.СтрокуJSONВСтруктуру(Param);
	//Дата	"2020-10-05T00:00:00"
	//Подразделение	"SD"
	//ТипДокумента	"Заявка на оплату"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.АЭ_Идентификатор = &Номер";
	Запрос.УстановитьПараметр("Номер",Стрзаменить(СокрЛП(СтруктураПараметров.Номер),"-",""));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат "Документ уже существует";
	КонецЦикла;
	Попытка
		НовДок                            = Документы.ПлатежноеПоручение.СоздатьДокумент();
		НовДок.АЭ_Идентификатор           = Стрзаменить(СокрЛП(СтруктураПараметров.Номер),"-","");
		НовДок.Дата                       = ТекущаяДата();
		НовДок.ВидОперации                = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
		//НовДок.ДокументОснование        = ;
		НовДок.Организация                = pcru_УМФО.Организация();
		НовДок.Налог                      = Справочники.ВидыНалоговИПлатежейВБюджет.НайтиПоНаименованию("");
		НовДок.ВидНалоговогоОбязательства = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		НовДок.СчетОрганизации            = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета","40702810903000479930",,НовДок.Организация);
		НовДок.Контрагент                 = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",СтруктураПараметров.Контрагент);
		//Запрос                            = Новый Запрос;
		//Запрос.Текст                      = "ВЫБРАТЬ
		//|	БанковскиеСчета.Ссылка КАК Ссылка
		//|ИЗ
		//|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		//|ГДЕ
		//|	БанковскиеСчета.Владелец        = &Владелец";
		//Запрос.УстановитьПараметр("Владелец",НовДок.Контрагент);
		//Выборка                           = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НовДок.СчетКонтрагента        = Выборка.Ссылка;
		//КонецЦикла;
		НовДок.СчетКонтрагента            = НовДок.Контрагент.ОсновнойБанковскийСчет;
		НовДок.СуммаДокумента             = СтруктураПараметров.Сумма;
		НовДок.СтавкаНДС                  = Перечисления.СтавкиНДС.НДС20;
		НовДок.СуммаНДС                   = (СтруктураПараметров.Сумма * 20)/120;
		НовДок.ВидПлатежа                 = "";
		НовДок.ОчередностьПлатежа         = 5;
		НовДок.НазначениеПлатежа          = "Оплата счета №" + СтруктураПараметров.Номер + " от " + СтруктураПараметров.Дата;
		НовДок.ВалютаДокумента            = pcru_УМФО.ВалютаРубль();
		НовДок.ТекстПлательщика           = УчетДенежныхСредствБП.СформироватьТекстНаименованияПлательщикаПолучателя("", НовДок.Организация,     НовДок.СчетОрганизации, Ложь, НовДок.Дата);
		НовДок.ТекстПолучателя            = УчетДенежныхСредствБП.СформироватьТекстНаименованияПлательщикаПолучателя("", НовДок.Контрагент,      НовДок.СчетКонтрагента, Ложь, НовДок.Дата);
		НовДок.Комментарий                = "Загружено из документооборота оплата счета №" + СтруктураПараметров.НомерДокумента + " от " + СтруктураПараметров.Дата;
		НовДок.ИННПлательщика             = НовДок.Организация.ИНН;
		НовДок.КПППлательщика             = НовДок.Организация.КПП;
		НовДок.ИННПолучателя              = НовДок.Контрагент.ИНН;
		НовДок.СтатьяДвиженияДенежныхСредств  =  Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Оплата поставщикам (подрядчикам)") ;
		Попытка
			НовДок.КПППолучателя          = НовДок.Контрагент.КПП;
		Исключение
		КонецПопытки;
		НовДок.ПодразделениеОрганизации   = Справочники.ПодразделенияОрганизаций.НайтиПоКоду("000000003");;
		Таблица                           = Неопределено;
		Если СтруктураПараметров.Свойство("Таблица",Таблица) Тогда
			Для каждого СтрокаТаблицы Из Таблица Цикл
				СтрРЗ = НовДок.пкру_РаспределениеЗатрат.Добавить();
				СтрРЗ.пкру_CostCentr      = pcru_УМФО.ПолучитьПодразделениеПоКостЦентру(СтрокаТаблицы.CostCentr);
				//++ Севрюгин А.А  30.12.2020 20:44:55   
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	pcru_ex_СопоставлениеВнешнихДанных.Значение КАК Значение
				               |ИЗ
				               |	РегистрСведений.pcru_ex_СопоставлениеВнешнихДанных КАК pcru_ex_СопоставлениеВнешнихДанных
				               |ГДЕ
				               |	pcru_ex_СопоставлениеВнешнихДанных.КодВнешнихДанных = &КодВнешнихДанных";
				Запрос.УстановитьПараметр("КодВнешнихДанных",СтрокаТаблицы.СтатьяРасходов );
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					 СтрРЗ.пкру_СтатьяРасходов =  Выборка.Значение;
				КонецЦикла;
				//-- Севрюгин А.А  30.12.2020 20:44:57 Администратор
				//Запрос                    = Новый Запрос;
				//Запрос.Текст = "ВЫБРАТЬ 
				//|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка,
				//|	ПрочиеДоходыИРасходы.Наименование КАК Наименование
				//|ИЗ
				//|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы";
				////Запрос.УстановитьПараметр("Наименование","%"+pcru_ex_РаботаСоСтроками.ПолучитьТолькоЦифры(СтрокаТаблицы.СтатьяРасходов)+"%");
				//ТЗ = Запрос.Выполнить().Выгрузить();
				//Для Каждого СтрокаТЗ Из ТЗ Цикл
				//	Если СтрЧислоВхождений(СтрокаТЗ.Наименование,pcru_ex_РаботаСоСтроками.ПолучитьТолькоЦифры(СтрокаТаблицы.СтатьяРасходов)) > 0 Тогда
				//		СтрРЗ.пкру_СтатьяРасходов =  СтрокаТЗ.Ссылка;
				//	КонецЕсли;
				//КонецЦикла;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	БНФОСубконто.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.БНФОСубконто КАК БНФОСубконто
				|ГДЕ
				|	БНФОСубконто.Владелец.Наименование = ""Тип затрат""
				|	И БНФОСубконто.Наименование = &Наименование";
				Запрос.УстановитьПараметр("Наименование",СтрокаТаблицы.ТипЗатрат );
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					СтрРЗ.ТипЗатрат       = Выборка.Ссылка;
				КонецЦикла;
				СтрРЗ.Сумма               = СтрокаТаблицы.Сумма;
			КонецЦикла; 
		КонецЕсли;
		НовДок.ДополнительныеСвойства.Вставить("АвторВерсии", Справочники.Пользователи.НайтиПоНаименованию("USER"));
		НовДок.Ответственный                  =  Справочники.Пользователи.НайтиПоНаименованию("USER");
		НовДок.Записать();
	Исключение
		Ошибка                            = ОписаниеОшибки();
		Возврат Ошибка;
	КонецПопытки;
	Возврат "ОК";
	//	 НовДок.КодБК                          =  ;
	//	 НовДок.КодОКАТО                       =  ;
	//	 НовДок.ПоказательДаты                 =  ;
	//	 НовДок.ПоказательНомера               =  ;
	//	 НовДок.ПоказательОснования            =  ;
	//	 НовДок.ПоказательПериода              =  ;
	//	 НовДок.ПоказательТипа                 =  ;
	//	 НовДок.СтатусСоставителя              =  ;
	//	 НовДок.Ответственный                  =  ;
	//	 НовДок.ПеречислениеВБюджет            =  ;
	//	 НовДок.ВидПеречисленияВБюджет         =  ;
	//	 НовДок.ДоговорКонтрагента             =  ;
	//	 НовДок.ИдентификаторПлатежа           =  ;
	//	 НовДок.ВидОперации                    =  ;
	//	 НовДок.ПлатежнаяВедомость             =  ;
	//	 НовДок.Банк                           =  ;
	//	 НовДок.СуммаПроцентов                 =  ;
	//	 НовДок.БНФОВнутрибанковскийПеревод    =  ;
	//	 НовДок.БНФОВидПлатежаПоКредитамЗаймам =  ;
	//	 НовДок.БНФОДоговорКредитаДепозита     =  ;
	//	 НовДок.АЭ_ДокументОснование           =  ;
	//	 НовДок.Налогоплательщик               =  ;
	//	 НовДок.АЭ_Идентификатор               =  ;
	//	 НовДок.АЭ_ДанныеИнтеграции            =  ;
	//	 НовДок.НачислениеДивидендов           =  ;
	//	 НовДок.АЭ_РежимИнтеграции             =  ;
	//	 НовДок.БНФОКонверсионныйДоговор       =  ;
	//	 НовДок.КодВыплат                      =  ;
	//	 НовДок.КодВидаДохода                  =  ;
	//   НовДок.Дата                           =  ;
	//	 НовДок.ДокументОснование              =  ;
	//	 НовДок.Организация                    =  ;
	//	 НовДок.Налог                          =  ;
	//	 НовДок.ВидНалоговогоОбязательства     =  ;
	//	 НовДок.СчетОрганизации                =  ;
	//	 НовДок.Контрагент                     =  ;
	//	 НовДок.СчетКонтрагента                =  ;
	//	 НовДок.СуммаДокумента                 =  ;
	//	 НовДок.СтавкаНДС                      =  ;
	//	 НовДок.СуммаНДС                       =  ;
	//	 НовДок.ВидПлатежа                     =  ;
	//	 НовДок.ОчередностьПлатежа             =  ;
	//	 НовДок.НазначениеПлатежа              =  ;
	//	 НовДок.ВалютаДокумента                =  ;
	//	 НовДок.ТекстПлательщика               =  ;
	//	 НовДок.ТекстПолучателя                =  ;
	//	 НовДок.Комментарий                    =  ;
	//	 НовДок.ИННПлательщика                 =  ;
	//	 НовДок.КПППлательщика                 =  ;
	//	 НовДок.ИННПолучателя                  =  ;
	//	 НовДок.КПППолучателя                  =  ;
	//	 НовДок.КодБК                          =  ;
	//	 НовДок.КодОКАТО                       =  ;
	//	 НовДок.ПоказательДаты                 =  ;
	//	 НовДок.ПоказательНомера               =  ;
	//	 НовДок.ПоказательОснования            =  ;
	//	 НовДок.ПоказательПериода              =  ;
	//	 НовДок.ПоказательТипа                 =  ;
	//	 НовДок.СтатусСоставителя              =  ;
	//	 НовДок.Ответственный                  =  ;
	//	 НовДок.ПодразделениеОрганизации       =  ;
	//	 НовДок.ПеречислениеВБюджет            =  ;
	//	 НовДок.ВидПеречисленияВБюджет         =  ;
	//	 НовДок.ДоговорКонтрагента             =  ;
	//	 НовДок.СтатьяДвиженияДенежныхСредств  =  ;
	//	 НовДок.ИдентификаторПлатежа           =  ;
	//	 НовДок.ВидОперации                    =  ;
	//	 НовДок.ПлатежнаяВедомость             =  ;
	//	 НовДок.Банк                           =  ;
	//	 НовДок.СуммаПроцентов                 =  ;
	//	 НовДок.БНФОВнутрибанковскийПеревод    =  ;
	//	 НовДок.БНФОВидПлатежаПоКредитамЗаймам =  ;
	//	 НовДок.БНФОДоговорКредитаДепозита     =  ;
	//	 НовДок.АЭ_ДокументОснование           =  ;
	//	 НовДок.Налогоплательщик               =  ;
	//	 НовДок.АЭ_Идентификатор               =  ;
	//	 НовДок.АЭ_ДанныеИнтеграции            =  ;
	//	 НовДок.НачислениеДивидендов           =  ;
	//	 НовДок.АЭ_РежимИнтеграции             =  ;
	//	 НовДок.БНФОКонверсионныйДоговор       =  ;
	//	 НовДок.КодВыплат                      =  ;
	//	 НовДок.КодВидаДохода                  =  ;
КонецФункции
